{
	"tb7": {
		"title": "Divine Space Battle",
		"date": "Nov 2025 - Jan 2026",
		"desc": "This project was my first foray into fast-paced animation, re-enacting a battle from the <i>Touhou Project</i>.<br/><br/>Following a one-year hiatus from animation, I used this project to completely re-evaluate my workflow. A major breakthrough was introducing a dedicated 'pre-production' phase, which utilizing blocking and animatics. It was instrumental in smoothing out the pacing. Additionally, because the choreography is original, I leaned heavily on a wider range of references for inspiration and movement logic.<br/><br/>On the technical side, I studied cinematography techniques to enhance the sense of motion, specifically focusing on shot composition and dynamic camera work. I also placed a much heavier emphasis on post-production, utilizing VFX and layered SFX to heighten the intensity of the combat.",
		"img": "tb7.jpg",
		"url": "https://www.youtube.com/embed/IdQMmZ71Bmk?si=zJjELShQgkC0S_xP"
	},
	"tb5": {
		"title": "Rin's Solo Camp",
		"date": "Jun 2024 - Aug 2024",
		"desc": "For this project, I focused on creating a calming environment, reminiscent of <i>Yuru Camp</i>'s signature aesthetic.<br/><br/>Key elements included a slow-paced narrative and a cool color palette, designed to evoke the same sense of tranquility found in the anime.<br/><br/>Technically, I incorporated cloth simulations to add realism to Rin's scarf and hand-painted the background mountains to achieve a 'painterly' look.",
		"img": "tb5.jpg",
		"url": "https://www.youtube.com/embed/RgBwLQty8B4?si=zJjELShQgkC0S_xP"
	},
	"tb3": {
		"title": "kessoku band -『忘れてやらない guitarhero COVER』",
		"date": "Apr 2024 - May 2024",
		"desc": "The focus for this project was on precision and attention to fine details since its an accurate recreation of a guitar performance. Each movement had to be frame-perfect to the audio beats. <br/><br/> Since I don't play the guitar personally, I asked many guitar-playing friends how they would approach certain sections, which helped refine hand positions and overall body movement. <br/><br/> Technically, I had to be comfortable with creating custom rig adjustments and using inverse kinematics (IK).",
		"img": "tb3.jpg",
		"url": "https://www.youtube.com/embed/_uEzKYpAo58?si=zJjELShQgkC0S_xP"
	},
	"tb1": {
		"title": "Happy Birthday.",
		"date": "Feb 2024 - Mar 2024",
		"desc": "For this project, I took my first step into formal storyboarding and creating an original narrative. <br/><br/>I wanted to build a short film centered around a specific in-game item, leaning into a subtle dark tone that was naturally enhanced by <i>Lethal Company</i>'s gritty, industrial aesthetic.<br/><br/>Beyond the story, I began to develop my own animation workflow and experimented with light video editing to enhance the storytelling.",
		"img": "tb1.png",
		"url": "https://www.youtube.com/embed/vHGuVzc_z68?si=zJjELShQgkC0S_xP"
	},
	"tb2": {
		"title": "GEO STATE",
		"date": "Sep 2023 - Nov 2023",
		"desc": "This project marked my first transition from short clips to a full-length scene, using <i>Genshin Impact</i> characters to interpret an iconic sequence from <i>Breaking Bad.</i><br/><br/>It was through the process of synchronizing dialogue with intricate facial expressions and gestures that I discovered my passion for specializing in character-driven work.<br/><br/>This project was vital to my creative development as I dipped into several aspects of the 3D pipeline, including lighting and rendering. ",
		"img": "tb2.png",
		"url": "https://www.youtube.com/embed/1YzAhbeAiUE?si=zJjELShQgkC0S_xP"
	}
}
